# Дана строка и нужно найти ее первое слово

input_ = str(input("Введите предложение"))
t = input_.split()
t1 = t[:1]
print(t1)
